micropython/micropython/lib/stm32n6/STM32N6xx_HAL_Driver/Inc/stm32n6xx_hal_adc_ex.h
  uint32_t ExternalTrigInjecConvEdge;     /*!< Selects the external trigger edge of injected group.
                                               This parameter can be a value of @ref ADC_injected_external_trigger_edge.
                                               If trigger source is set to ADC_INJECTED_SOFTWARE_START, this parameter
                                               is discarded.
                                               Caution: this setting impacts the entire injected group. Therefore,
                                                        call of  HAL_ADCEx_InjectedConfigChannel() to configure a
                                                        channel on injected group can impact the configuration of other
                                                        channels previously set. */

  FunctionalState InjecOversamplingMode;        /*!< Specifies whether the oversampling feature is enabled or disabled.
                                                     This parameter can be set to ENABLE or DISABLE.
                                                     Note: This parameter can be modified only if there is no conversion
                                                           is ongoing (both ADSTART and JADSTART cleared). */

  ADC_InjOversamplingTypeDef  InjecOversampling; /*!< Specifies the Oversampling parameters.
                                                      Caution: this setting overwrites the previous oversampling
                                                               configuration if oversampling already enabled.
                                                      Note: This parameter can be modified only if there is no
                                                            conversion is ongoing (both ADSTART and
                                                            JADSTART cleared).*/
} ADC_InjectionConfTypeDef;

#if defined(ADC_MULTIMODE_SUPPORT)
/**
  * @brief  Structure definition of ADC multimode
  * @note   The setting of these parameters by function HAL_ADCEx_MultiModeConfigChannel() is conditioned by ADCs
  *         state (both Master and Slave ADCs).
  *         Both Master and Slave ADCs must be disabled.
  */
typedef struct
{
  uint32_t Mode;              /*!< Configures the ADC to operate in independent or multimode.
                                   This parameter can be a value of @ref ADC_HAL_EC_MULTI_MODE. */

  uint32_t DualModeData;      /*!< Configures the Dual ADC Mode Data Format:
                                   This parameter can be a value of @ref ADCEx_Dual_Mode_Data_Format */

  uint32_t TwoSamplingDelay;  /*!< Configures the Delay between 2 sampling phases.
                                   This parameter can be a value of @ref ADC_HAL_EC_MULTI_TWOSMP_DELAY */
} ADC_MultiModeTypeDef;
#endif /* ADC_MULTIMODE_SUPPORT */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup ADCEx_Exported_Constants ADC Extended Exported Constants
  * @{
  */

/** @defgroup ADC_injected_external_trigger_source ADC group injected trigger source
  * @{
  */
/* ADC group regular trigger sources for all ADC instances */
#define ADC_INJECTED_SOFTWARE_START        (LL_ADC_INJ_TRIG_SOFTWARE)           /*!< ADC group injected conversion
                                           trigger internal: SW start. */
#define ADC_EXTERNALTRIGINJEC_EXT_IT15     (LL_ADC_INJ_TRIG_EXT_EXTI_LINE15)    /*!< ADC group injected conversion
                                           trigger from external peripheral: external interrupt line 15. */
#define ADC_EXTERNALTRIGINJEC_T1_CC4       (LL_ADC_INJ_TRIG_EXT_TIM1_CH4)       /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM1 channel 4 event (capture compare). */
#define ADC_EXTERNALTRIGINJEC_T1_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM1_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM1 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T1_TRGO2     (LL_ADC_INJ_TRIG_EXT_TIM1_TRGO2)     /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM1 TRGO2 event. */
#define ADC_EXTERNALTRIGINJEC_T2_CC1       (LL_ADC_INJ_TRIG_EXT_TIM2_CH1)       /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM2 channel 1 event (capture compare). */
#define ADC_EXTERNALTRIGINJEC_T2_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM2_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM2 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T3_CC1       (LL_ADC_INJ_TRIG_EXT_TIM3_CH1)       /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM3 channel 1 event (capture compare). */
#define ADC_EXTERNALTRIGINJEC_T3_CC3       (LL_ADC_INJ_TRIG_EXT_TIM3_CH3)       /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM3 channel 3 event (capture compare). */
#define ADC_EXTERNALTRIGINJEC_T3_CC4       (LL_ADC_INJ_TRIG_EXT_TIM3_CH4)       /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM3 channel 4 event (capture compare). */
#define ADC_EXTERNALTRIGINJEC_T3_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM3_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM3 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T4_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM4_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM4 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T5_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM5_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM5 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T6_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM6_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM6 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T7_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM7_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM7 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T8_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM8_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM8 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T8_TRGO2     (LL_ADC_INJ_TRIG_EXT_TIM8_TRGO2)     /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM8 TRGO2 event. */
#define ADC_EXTERNALTRIGINJEC_T9_CC2       (LL_ADC_INJ_TRIG_EXT_TIM9_CH2)       /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM9 channel 2 event (capture compare). */
#define ADC_EXTERNALTRIGINJEC_T9_TRGO      (LL_ADC_INJ_TRIG_EXT_TIM9_TRGO)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM9 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T12_TRGO     (LL_ADC_INJ_TRIG_EXT_TIM12_TRGO)     /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM12 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T12_CC4      (LL_ADC_INJ_TRIG_EXT_TIM12_CH4)      /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM12 channel 4 event (capture compare). */
#define ADC_EXTERNALTRIGINJEC_T15_TRGO     (LL_ADC_INJ_TRIG_EXT_TIM15_TRGO)     /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM12 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_T18_TRGO     (LL_ADC_INJ_TRIG_EXT_TIM18_TRGO)     /*!< ADC group injected conversion
                                           trigger from external peripheral: TIM12 TRGO event. */
#define ADC_EXTERNALTRIGINJEC_LPTIM1_CH2   (LL_ADC_INJ_TRIG_EXT_LPTIM1_CH2)     /*!< ADC group injected conversion
                                           trigger from external peripheral: LPTIM1 channel 2 event. */
#define ADC_EXTERNALTRIGINJEC_LPTIM2_CH2   (LL_ADC_INJ_TRIG_EXT_LPTIM2_CH2)     /*!< ADC group injected conversion
                                           trigger from external peripheral: LPTIM2 channel 2 event. */
#define ADC_EXTERNALTRIGINJEC_LPTIM3_CH2   (LL_ADC_INJ_TRIG_EXT_LPTIM3_CH2)     /*!< ADC group injected conversion
                                           trigger from external peripheral: LPTIM3 channel 2 event. */
/**
  * @}
  */

